src/Catalogs/Контроль/Контроль.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контроль</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПостановкиНаКонтроль</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСнятияСКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсполнителиСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>BusinessProcessRef.Исполнение</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
    </type>
  </attributes>
  <attributes>
    <name>Контролер</name>
    <type>
      <types>CatalogRef.ПолныеРоли</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставленНаКонтроль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
      <types>CatalogRef.ВеткиПереписки</types>
      <types>BusinessProcessRef</types>
      <types>TaskRef</types>
    </type>
  </attributes>
  <attributes>
    <name>СнятСКонтроля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДополнительныйОбъектАдресацииКонтролера</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКонтролер</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОсновнойОбъектАдресацииКонтролера</name>
    <type>
      <types>Characteristic.ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>ДатаИсполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонтроля</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.ПолныеРоли</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>Источник</name>
      <type>
        <types>BusinessProcessRef.Исполнение</types>
        <types>DocumentRef.ВходящееПисьмо</types>
        <types>TaskRef.ЗадачаИсполнителя</types>
        <types>DocumentRef.ИсходящееПисьмо</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проконтролировано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьДополнительныйОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьИсполнитель</name>
      <type>
        <types>CatalogRef.РолиИсполнителей</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОсновнойОбъектАдресации</name>
      <type>
        <types>Characteristic.ОбъектыАдресацииЗадач</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Контроль/Forms/ПереносСрока/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	СтарыйСрок = Параметры.СрокИсполнения;
	ТекущийПользователь = ПользователиКлиентСервер.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтрольИсполнители.Исполнитель
		|ИЗ
		|	Справочник.Контроль.Исполнители КАК КонтрольИсполнители
		|ГДЕ
		|	КонтрольИсполнители.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Параметры.Контроль);
	ТаблицаИсполнителей = Запрос.Выполнить().Выгрузить();
	ЗначениеВРеквизитФормы(ТаблицаИсполнителей, "Исполнители");
	
	Если ЗначениеЗаполнено(СтарыйСрок) Тогда
		НачальныйСрок = СтарыйСрок;
	Иначе 
		НачальныйСрок = ТекущаяДата();
	КонецЕсли;
	
	// Заполнение готовых вариантов контрольных сроков
	СписокВыбора = Элементы.НовыйСрокДата.СписокВыбора;
	Элементы.НовыйСрокДата.СписокВыбора.Добавить(НачальныйСрок + 1*24*3600,			НСтр("ru = '1 день'"));
	Элементы.НовыйСрокДата.СписокВыбора.Добавить(НачальныйСрок + 2*24*3600, 		НСтр("ru = '2 дня'"));	
	Элементы.НовыйСрокДата.СписокВыбора.Добавить(НачальныйСрок + 3*24*3600, 		НСтр("ru = '3 дня'"));	
	Элементы.НовыйСрокДата.СписокВыбора.Добавить(НачальныйСрок + 7*24*3600, 		НСтр("ru = 'Неделя'"));
	Элементы.НовыйСрокДата.СписокВыбора.Добавить(ДобавитьМесяц(НачальныйСрок, 1), 	НСтр("ru = 'Месяц'"));
	
	// Новый срок по умолчанию
	Если ЗначениеЗаполнено(СтарыйСрок) Тогда
		НовыйСрок = СтарыйСрок + 24*3600;
		ДлительностьПереноса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("(+ %1)",
			ДелопроизводствоКлиентСервер.РазностьДатВДнях(НовыйСрок, СтарыйСрок));
	Иначе 
		НовыйСрок = ТекущаяДата() + 24*3600;
		Элементы.ДлительностьПереноса.Видимость = Ложь;
	КонецЕсли;
	
	ПроверятьОтсутствие = Отсутствия.ПредупреждатьОбОтсутствии();
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		НастроитьЭлементыФормыДляМобильногоУстройства();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НовыйСрокДатаПриИзменении(Элемент)

	Если ЗначениеЗаполнено(НовыйСрок) И ЗначениеЗаполнено(СтарыйСрок) Тогда
		Если СтарыйСрок < НовыйСрок Тогда 
			ДлительностьПереноса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("(+ %1)",
				ДелопроизводствоКлиентСервер.РазностьДатВДнях(НовыйСрок, СтарыйСрок));
		Иначе 
			ДлительностьПереноса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("(- %1)",
				ДелопроизводствоКлиентСервер.РазностьДатВДнях(СтарыйСрок, НовыйСрок));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиИЗакрыть(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПеренестиИЗакрытьЗавершение", ЭтотОбъект);
	Если Не ОтсутствияКлиент.ПроверитьОтсутствиеПоКонтролю(ЭтаФорма,
			Исполнители, НовыйСрок, ОписаниеОповещения) Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьОбработкуОповещения(ОписаниеОповещения, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиИЗакрытьЗавершение(Результат, Параметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("НовыйСрок", НовыйСрок);
	ПараметрыОповещения.Вставить("СтарыйСрок", СтарыйСрок);
	
	Закрыть(ПараметрыОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьЭлементыФормыДляМобильногоУстройства()
	
	// Подготовим общие кнопки.
	Элементы.ФормаПеренестиИЗакрыть.Картинка = БиблиотекаКартинок.ЗаписатьИЗакрыть;
	Элементы.ФормаПеренестиИЗакрыть.Отображение = ОтображениеКнопки.Картинка;
	Элементы.ГруппаПанельУправления.Видимость = Ложь;
	
	// Подготовим поля дат.
	Элементы.СтарыйСрок.РастягиватьПоГоризонтали = Истина;
	Элементы.СтарыйСрок.АвтоМаксимальнаяШирина = Ложь;
	
	Элементы.НовыйСрокДата.Ширина = 0;
	Элементы.НовыйСрокДата.РастягиватьПоГоризонтали = Истина;
	Элементы.НовыйСрокДата.АвтоМаксимальнаяШирина = Ложь;
	Элементы.НовыйСрокДата.КнопкаВыпадающегоСписка = Ложь;
	
	Элементы.ДлительностьПереноса.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	
	// Для выбора даты не будем выдавать список.
	Элементы.НовыйСрокДата.СписокВыбора.Очистить();
	
КонецПроцедуры

#КонецОбласти
